schedule/terminarz.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>terminarz</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-10-15 16:52:54 CEST"/>
<meta name="author" content="Wojtek"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">terminarz</h1>

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="all">
<colgroup><col class="right" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">Kiedy</th><th scope="col" class="left">Kto</th><th scope="col" class="left">O czym</th></tr>
</thead>
<tbody>
<tr><td class="right">28.09.2011</td><td class="left"></td><td class="left">Spotkanie organizacyjne</td></tr>
<tr><td class="right">05.10.2011</td><td class="left">P. Wieczorek</td><td class="left">Teoria typów Martina-Löfa</td></tr>
<tr><td class="right">12.10.2011</td><td class="left">P. Wieczorek</td><td class="left">Teoria typów Martina-Löfa c.d.</td></tr>
<tr><td class="right">19.10.2011</td><td class="left">W. Jedynak</td><td class="left">Wprowadzanie do Agdy</td></tr>
<tr><td class="right">26.10.2011</td><td class="left">W. Jedynak</td><td class="left">Wprowadzenie do Agdy c.d</td></tr>
<tr><td class="right">02.11.2011</td><td class="left">M. Imiełowski</td><td class="left">Piękno i elegancja typów zależnych</td></tr>
<tr><td class="right">09.11.2011</td><td class="left">A. Balicki i Ł. Zapart</td><td class="left">Gdy rekursja strukturalna może nie wystarczać</td></tr>
<tr><td class="right">23.11.2011</td><td class="left">S. Laszczyński</td><td class="left">Koindukcja</td></tr>
<tr><td class="right">30.11.2011</td><td class="left">M. Januszkiewicz</td><td class="left">Widoki</td></tr>
<tr><td class="right">07.11.2011</td><td class="left">P. Polesiuk</td><td class="left">Reprezentacja języków z wiązaniem zmiennych</td></tr>
<tr><td class="right">14.11.2011</td><td class="left">M. Kotowicz</td><td class="left">Typy zależne w Haskellu</td></tr>
<tr><td class="right">04.01.2012</td><td class="left">F. Król</td><td class="left">Agdowe spojrzenie na klasy typów</td></tr>
<tr><td class="right">11.01.2012</td><td class="left">M. Jurkiewicz</td><td class="left">Programowanie generyczne</td></tr>
<tr><td class="right">18.01.2012</td><td class="left">?</td><td class="left">?</td></tr>
</tbody>
</table>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Wyciąg z terminarza: </a>
<ul>
<li><a href="#sec-1-1">1.1 16 listopada 2011 (środa) będą przeprowadzone zajęcia wtorkowe; </a></li>
<li><a href="#sec-1-2">1.2 Przerwa świąteczna: 23.12.2011 – 02.01.2012 </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Wyciąg z terminarza: </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 16 listopada 2011 (środa) będą przeprowadzone zajęcia wtorkowe; </h3>
<div class="outline-text-3" id="text-1-1">

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Przerwa świąteczna: 23.12.2011 – 02.01.2012 </h3>
<div class="outline-text-3" id="text-1-2">


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-10-15 16:52:54 CEST</p>
<p class="author">Author: Wojtek</p>
<p class="creator">Org version 7.7 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
